//! FUNCTION DECLARATION 
task1();//!функцияны чакыруу работает
function task1(){
    let aa =10; //?локалный
    console.log(a);
}
console.log(a); //error

task1


// //! FUNCTION EXPRESSION
task2();  
let b = 10 // глобалгый
let task2 = function (){
    console.log(b);//10
};
console.log(b);//10
task2(); //функцияны чакыруу

function checkTask(a,b,c){ //!-(бул параметрлар)
    if(a % 2 ===0){
        console.log('true');
    }else {
        console.log('false');
    }
}

checkTask(66,100, 'Hello World') //! аргумент параметрдвн знамениясы



//TODO Klass work

// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Верно'.
// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.
// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в консоль "Четное число", "Нечетное число".
// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".
// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной - "boolean", "number", "string".


