    
// 1. Вам дана переменная str = 'Nevis ITDB TECH'. Выведите в консоль длину первого слова.

// function  task1(str){
// console.log(str.slice(0,5).length);
// }
// task1('Nevis ITDB TECH')


// 2. Вам дана переменная str = 'Максимально УЖАСНО'. Выведите в консоль слово УЖАСНО,

// function task2(str){
// console.log(str.slice(12));
// }
// task2('Максимально УЖАСНО')


// 3. Вам дана переменная str = 'максимально УЖАСНО'. Выведите в консоль слово максимально,
// только верхним регистром.
//  function task3 (str){
// console.log(str.slice(0,11).toUpperCase());

//  }
// task3('максимально УЖАСНО')

// 4. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль 'мально Ужасно',
// используя метод slice.
// function task4 (str){
// console.log(str.slice(5));

// }
// task4('Mаксимально УЖАСНО')


// 5. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль букву У, использую метод
// charAt.

// function task5(str){
// console.log(str.charAt(12));

// }
// task5('Mаксимально УЖАСНО')

// 6. Вам даны переменные str = 'Максимально', str2 = 'Ужасно'. Выведите в консоль соединенные
// строки, используя метод concat.
// let task6 = function(str1,str2){
// console.log(str1.concat(str2));
// }
// task6('Максимально ','Ужасно')

// 7. Вам дана переменная str = 'макСИМАЛЬНО ужаСНО'. Выведите в консоль первую букву
//  в верхний регистр.

// function task7(str){
//     console.log(str[0].toUpperCase() + str.slice(1).toLowerCase());
// }
// task7('макСИМАЛЬНО ужаСНО')

// 8. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого вхождения
// буквы а.
// function task8(str){
// console.log(str.indexOf('а'));
// }
// task8('Максимально Ужасно')

// 9. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого последнего
// буквы о.
// function task10(str){
// console.log(str.lastIndexOf('о'));
// }
// task9('Максимально Ужасно')


// 10. Вам дана переменная str = 'aaa bbb ccc'. Вырежите из нее слово 'bbb'

// function task10(str){
//   console.log(str.slice(4,7));
// }
// task10( 'aaa bbb ccc')


