// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.

// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться 'a больше b', 'a меньше b'.

// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.

// 4. Вам дана переменная number=45. Составьте условие, по которому будет 
// выводиться в консоль "Четное число", "Четное число"

// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".

// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной
//  - "boolean", "number", "string".

//!  1
// let a = 10

// if(a === 10 ){
//     console.log('Верно');
// }else{
//     console.log('Неверно');
// }

//! 2
// let  a = 50
// let  b =100
// if(b > a){
//     console.log('a меньше b');
// }else{
//     console.log('a больше b');
// }

//! 3
// let a = -2

// if(a > 0){
//     console.log('positive');
// }else if(a=== 0){
//     console.log('равно' );
// }else if(a < 0){
//     console.log("negative");
// }

//! 4
// let num =45
// if(num %45 ===0){
//     console.log("Четное число");
// }else{
//     console.log("нечетное число");
// }
//  //! 5
//  let a = 10
//  let b =2
//  if(a % b ===0){
//     console.log("Четное число");
//  }else{
//     console.log("Нечетное число");
//  }

//! 6
// let s = "5"
// if(typeof s == "boolean"){
//     console.log('boolean');
// }else if (typeof s == "number"){
//     console.log("number");
// }else if (typeof s == "string"){
//     console.log("string");
// }





















