// let i = 0

// console.log(++i ,"1");
// console.log(i++ ,"1");
// console.log(++i ,"3");
// console.log(i++ ,"3");

// for(let i = 10; i >= 1; i--){
// console.log(i);
// }

// 10 
// 9 
// 8 
// 7 
// 6 
// 5  
// 4 
// 3 
// 2 
// 1


// for(let i = 10; i >= 1; i--){
// console.log(i);
// }

// let arr = ["Paul", "John", "George", "Ringo", "Yoko"];

// for(let i = 0; i < arr.length;i ++ ){
//     console.log(arr[i]);
// }

// Paul 
// John 
// George 
// Ringo 
// Yoko

// выведите поочерёдно в консоль все элементы, которые меньше 5, используя цикл for
// let arr = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]


//? Создайте переменную arr. Пройдитесь по всем элементам массива циклом, сложите 
//?их и выведите сумму в консоль:
//? К примеру, если в переменной arr хранится данный массив - [1, 2, 3, 4, 5]
//? то вывод должен быть:
//? 15

// let arr = [1, 2, 3, 4, 5]
// let sum = 0
// for(let i of arr){
//  sum += i
// }
// console.log(sum);


//?Напишите цикл, который за 7 вызовов console.log 
//?выводит такой треугольник:
//? #
//? ##
//? ###
//? ####
//? #####
//? ######
//? #######

// let str = '#'

// while(str.length <= 7){
//   console.log(str);
//   str += '#';
// }



//? выведите поочерёдно в консоль все элементы, которые меньше 5, используя цикл for of

// let array = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

// for(let i of array){
// if(i < 5)
// console.log(i);
// }


//? Создайте строку str. Выведите в консоль только те символы, у которых четный индексНапример:
//? let str = 'Hello'
//? Вывод:
//? Hl
//? o

//? Создайте двумерный массив matrix Выведите в консоль каждый элемент вложенных массивовНапример:
//? let matrix = [  [1, 2, 3],
//?   [4, 5, 6],
//?   [7, 8, 9]
//? ]
//? Вывод:


//? Создайте многомерный массив names состоящий из строк:
//? Выведнсоль только те имена, длинна которых больше 4-х символовВывод:

// const names = [  [
//     ['Helen', 'Tom'],
//     ['Jack', 'Peter']
//   ],
//   [
//     ['Jessica', 'Bob'],
//     ['Jimm', 'John']
//   ],
//   [
//     ['Alexa', 'Jessy'],
//     ['David', 'Paul']
//   ]
// ]
//  for(let i of names){
//     for(let a of )
// console.log();


//  }
// Helen
// Peter
// Jessica
// Alexa
// Jessy
// David













// 1
// 2
// 3
// 4
// 5
// 6
// 7
// 8
// 9











